[
  {
    "id": 1,
    "title": "Russia-Ukraine War",
    "countries": ["Russia", "Ukraine"],
    "continent": "Europe",
    "description": "Ongoing since February 2022, the Russia-Ukraine War represents one of the most significant military conflicts in Europe since World War II. This conflict began with Russia's annexation of Crimea in 2014, which triggered international condemnation and led to rising tensions. The full-scale invasion in 2022 has resulted in territorial disputes and economic impacts across Europe and beyond. International sanctions have been imposed on Russia, and the situation has created an energy crisis affecting European markets. Civilians face hardships due to displacement, destruction of infrastructure, and a large-scale humanitarian crisis requiring global aid.",
    "imageSrcUrl": "/cache_images/Russia_Ukraine.jpg",
    "imageDesc": "Russia's war in Ukraine is the most disruptive conflict that Europe has seen since 1945",
    "casualties": 10000,
    "displacement": 8000000,
    "basic_info": "Conflict began with Russia's annexation of Crimea in 2014, escalating into full invasion in 2022. The war has prompted extensive global political and economic impacts.",
    "latitude": 48.3794,
    "longitude": 31.1656,
    "charities_resources": [
      {
        "name": "UNICEF",
        "url": "https://www.unicef.org/emergencies/ukraine-war"
      },
      {
        "name": "Red Cross",
        "url": "https://www.icrc.org/en/where-we-work/europe-central-asia/ukraine"
      }
    ],
    "timeline": [
      {
        "date": "2014",
        "event": "Russia annexed Crimea, leading to condemnation and sanctions."
      },
      {
        "date": "2022",
        "event": "Full-scale invasion of Ukraine by Russia begins."
      },
      {
        "date": "2022-03",
        "event": "International sanctions imposed on Russia."
      },
      {
        "date": "2023-04",
        "event": "Peace talks held but end without resolution."
      }
    ]
  },
  {
    "id": 2,
    "title": "Israeli-Palestinian Conflict",
    "countries": ["Israel", "Palestine"],
    "continent": "Asia",
    "description": "The Israeli-Palestinian conflict, rooted in early 20th-century disputes, continues over land, national identity, and sovereignty. The situation remains volatile, with Gaza and the West Bank experiencing frequent escalations. Both sides have significant historical grievances, and numerous attempts at peace have failed to achieve a lasting solution. Many civilians have been displaced, and each flare-up exacerbates the humanitarian crisis. International organizations have attempted to mediate, but security and quality of life remain challenges in the region.",
    "imageSrcUrl": "/cache_images/PalestineVsIsrael.webp",
    "imageDesc": "A woman looks for salvageable items following Israeli bombardment at al-Shati refugee camp in Gaza City on June 22, 2024",
    "casualties": 1000,
    "displacement": 5700000,
    "basic_info": "Roots of the conflict trace back to the early 20th century, with ongoing disputes over land and rights leading to periodic violence.",
    "latitude": 31.0461,
    "longitude": 34.8516,
    "charities_resources": [
      {
        "name": "Doctors Without Borders",
        "url": "https://www.doctorswithoutborders.org"
      },
      {
        "name": "UNRWA",
        "url": "https://www.unrwa.org"
      }
    ],
    "timeline": [
      {
        "date": "1948",
        "event": "Establishment of Israel and beginning of ongoing disputes."
      },
      {
        "date": "1967",
        "event": "Six-Day War results in Israeli control of Gaza and West Bank."
      },
      { "date": "1993", "event": "Oslo Accords signed with hopes of peace." },
      {
        "date": "2023",
        "event": "Increased violence and international mediation attempts."
      }
    ]
  },
  {
    "id": 3,
    "title": "Yemeni Civil War",
    "countries": ["Yemen"],
    "continent": "Asia",
    "description": "The Yemeni Civil War, beginning in 2014, has become one of the worst humanitarian crises in recent history. Fighting between the Houthi movement and the internationally recognized government, with influence from regional powers, has led to widespread famine and health challenges. Millions are at risk of starvation, and civilians face dire health and security conditions. This ongoing conflict has drawn attention from international humanitarian organizations, yet effective intervention remains challenging due to complex political and military dynamics.",
    "imageSrcUrl": "/cache_images/YemenCW.jpg",
    "imageDesc": "Supporters of the Houthi movement take part in a protest in Sana'a",
    "casualties": 377000,
    "displacement": 4000000,
    "basic_info": "Conflict has created one of the world's worst humanitarian crises, with widespread famine and health issues.",
    "latitude": 15.5527,
    "longitude": 48.5164,
    "charities_resources": [
      {
        "name": "Yemen Relief and Reconstruction Foundation",
        "url": "https://www.yemenfoundation.org"
      },
      {
        "name": "UN World Food Programme",
        "url": "https://www.wfp.org/countries/yemen"
      }
    ],
    "timeline": [
      { "date": "2014", "event": "Houthi forces capture the capital, Sana'a." },
      { "date": "2015", "event": "Saudi-led coalition intervenes in Yemen." },
      { "date": "2020", "event": "UN reports Yemen facing famine conditions." },
      { "date": "2022", "event": "Ceasefire declared but remains fragile." }
    ]
  },
  {
    "id": 4,
    "title": "Syrian Civil War",
    "countries": ["Syria"],
    "continent": "Asia",
    "description": "Starting in 2011, the Syrian Civil War has evolved from civil unrest into a multi-sided conflict involving the Syrian government, rebel groups, ISIS, and international actors. The war began with protests during the Arab Spring and has led to a massive refugee crisis, impacting neighboring countries and Europe. Global powers like the United States and Russia have been involved in different capacities, leading to a prolonged and devastating conflict with extensive casualties and displaced populations.",
    "imageSrcUrl": "/cache_images/SyrianCW.jpg",
    "imageDesc": "March 2022 marked 11 years since the start of the civil war in Syria, which ended with a bitter defeat for the opposition and a “hollow victory” for Syrian President Bashar al-Assad.",
    "casualties": 500000,
    "displacement": 6600000,
    "basic_info": "Sparked by the Arab Spring protests, the conflict has escalated into a complex proxy war involving regional and global powers.",
    "latitude": 34.8021,
    "longitude": 38.9968,
    "charities_resources": [
      {
        "name": "Syrian American Medical Society",
        "url": "https://www.sams-usa.net"
      },
      {
        "name": "International Rescue Committee",
        "url": "https://www.rescue.org/country/syria"
      }
    ],
    "timeline": [
      {
        "date": "2011",
        "event": "Arab Spring protests start, leading to civil unrest."
      },
      {
        "date": "2013",
        "event": "Chemical weapons used, leading to international outcry."
      },
      {
        "date": "2015",
        "event": "Russia intervenes in support of the Assad regime."
      },
      {
        "date": "2023",
        "event": "Conflict continues with humanitarian crises."
      }
    ]
  },
  {
    "id": 5,
    "title": "Sudanese Civil War",
    "countries": ["Sudan"],
    "continent": "Africa",
    "description": "Since April 2023, Sudan has been engulfed in a civil war between the Sudanese Armed Forces and the Rapid Support Forces, with intense violence in the capital and rural areas. The violence has caused civilian casualties and the displacement of millions, leading to a humanitarian crisis. Neighboring countries are also affected by refugee flows, and the international community has attempted to broker peace, but the conflict remains active with severe social and economic impacts.",
    "imageSrcUrl": "/cache_images/SudaneseCivilWar.jpg",
    "imageDesc": "Destruction in Khartoum amid the Sudanese Civil War.",
    "casualties": 10000,
    "displacement": 4000000,
    "basic_info": "The conflict has resulted in significant civilian casualties and displacement, with many fleeing to neighboring countries.",
    "latitude": 15.5007,
    "longitude": 32.5599,
    "charities_resources": [
      {
        "name": "International Rescue Committee",
        "url": "https://www.rescue.org/country/sudan"
      },
      {
        "name": "UN World Food Programme",
        "url": "https://www.wfp.org/countries/sudan"
      }
    ],
    "timeline": [
      {
        "date": "2023-04",
        "event": "Outbreak of civil war between Sudanese Armed Forces and Rapid Support Forces."
      },
      {
        "date": "2023-05",
        "event": "International community begins evacuation efforts for foreign nationals."
      },
      {
        "date": "2023-06",
        "event": "UN warns of escalating humanitarian crisis due to displacement and food shortages."
      },
      {
        "date": "2023-08",
        "event": "Peace negotiations attempted but fail to reach a ceasefire."
      }
    ]
  },
  {
    "id": 6,
    "title": "Ethiopian Conflict",
    "countries": ["Ethiopia"],
    "continent": "Africa",
    "description": "Ethiopia has seen numerous regional conflicts, primarily in the Tigray, Oromia, and Amhara regions. While the Tigray conflict saw a ceasefire, instability remains in other regions due to ethnic and political tensions. Civilians face shortages of essential resources, and violence has disrupted lives, creating a need for international humanitarian support. The Ethiopian government and various ethnic groups struggle for control, further complicating the path to lasting peace.",
    "imageSrcUrl": "/cache_images/EthiopianConflict.jpg",
    "imageDesc": "Displaced families in Ethiopia due to regional conflicts.",
    "casualties": 5000,
    "displacement": 2000000,
    "basic_info": "Despite a ceasefire in the Tigray region, other areas continue to experience violence, affecting millions.",
    "latitude": 9.145,
    "longitude": 40.4897,
    "charities_resources": [
      {
        "name": "UNICEF Ethiopia",
        "url": "https://www.unicef.org/ethiopia/emergencies"
      },
      {
        "name": "Doctors Without Borders",
        "url": "https://www.doctorswithoutborders.org/what-we-do/countries/ethiopia"
      }
    ],
    "timeline": [
      {
        "date": "2020-11",
        "event": "Conflict erupts in Tigray region between government forces and TPLF."
      },
      {
        "date": "2021-06",
        "event": "Tigray forces recapture much of the region as government forces withdraw."
      },
      {
        "date": "2022-03",
        "event": "Ceasefire announced, allowing for humanitarian aid access."
      },
      {
        "date": "2023-01",
        "event": "Instability remains in Oromia and Amhara regions, despite Tigray ceasefire."
      }
    ]
  },
  {
    "id": 7,
    "title": "Sahel Conflict",
    "countries": ["Mali", "Burkina Faso", "Niger"],
    "continent": "Africa",
    "description": "The Sahel region in Africa, encompassing Mali, Burkina Faso, and Niger, is plagued by violence from armed groups, often linked to terrorism and regional instability. This conflict has led to mass displacement, a breakdown of security, and a humanitarian crisis. The withdrawal of international forces has exacerbated the situation, with communities suffering from food insecurity, violence, and displacement. Political upheavals in the region also contribute to the instability, making it difficult to establish lasting peace.",
    "imageSrcUrl": "/cache_images/SahelConflict.jpg",
    "imageDesc": "Communities in the Sahel region affected by ongoing conflicts.",
    "casualties": 10000,
    "displacement": 3000000,
    "basic_info": "The withdrawal of international forces and political upheavals have exacerbated the security situation in the region.",
    "latitude": 17.5707,
    "longitude": 3.9962,
    "charities_resources": [
      {
        "name": "International Committee of the Red Cross",
        "url": "https://www.icrc.org/en/where-we-work/africa/sahel"
      },
      {
        "name": "UNHCR Sahel Crisis",
        "url": "https://www.unhcr.org/sahel-crisis.html"
      }
    ],
    "timeline": [
      {
        "date": "2012",
        "event": "Conflict begins in Mali following a coup and rise of armed groups."
      },
      {
        "date": "2017",
        "event": "G5 Sahel joint force established to combat terrorism and instability."
      },
      {
        "date": "2021",
        "event": "France announces withdrawal of Operation Barkhane, raising security concerns."
      },
      {
        "date": "2023",
        "event": "Violence intensifies, affecting millions across Mali, Burkina Faso, and Niger."
      }
    ]
  },
  {
    "id": 8,
    "title": "Haiti Gang Violence",
    "countries": ["Haiti"],
    "continent": "North America",
    "description": "Haiti faces extreme violence linked to armed gangs, significantly affecting Port-au-Prince and other areas. This ongoing crisis, fueled by political instability and economic hardship, has led to deteriorating living conditions, shortages of basic goods, and limited access to healthcare and education. Efforts by local authorities and international organizations to stabilize the situation have seen limited success, as gang violence continues to disrupt daily life for many Haitians.",
    "imageSrcUrl": "/cache_images/HaitiGangViolence.jpg",
    "imageDesc": "Streets of Port-au-Prince affected by gang violence.",
    "casualties": 2000,
    "displacement": 200000,
    "basic_info": "The violence has disrupted daily life, leading to shortages of essential goods and services.",
    "latitude": 18.9712,
    "longitude": -72.2852,
    "charities_resources": [
      {
        "name": "UNICEF Haiti",
        "url": "https://www.unicef.org/haiti/"
      },
      {
        "name": "World Food Programme Haiti",
        "url": "https://www.wfp.org/countries/haiti"
      }
    ],
    "timeline": [
      {
        "date": "2010",
        "event": "Haiti suffers devastating earthquake, worsening economic and security conditions."
      },
      {
        "date": "2021",
        "event": "President Jovenel Moïse assassinated, increasing political instability."
      },
      {
        "date": "2022-08",
        "event": "Gang violence escalates, with armed groups controlling parts of Port-au-Prince."
      },
      {
        "date": "2023-04",
        "event": "International community calls for intervention to address gang violence."
      }
    ]
  },
  {
    "id": 9,
    "title": "Myanmar Civil Conflict",
    "countries": ["Myanmar"],
    "continent": "Asia",
    "description": "Following the military coup in Myanmar in 2021, the country has experienced escalating conflicts between the junta and ethnic armed groups. Civilian casualties are high, and human rights abuses have been reported, drawing global condemnation. Various ethnic groups are engaged in armed resistance, and sanctions have been imposed on the ruling military. Despite international calls for peace, the conflict continues to cause widespread suffering and displacement among the civilian population.",
    "imageSrcUrl": "/cache_images/MyanmarConflict.jpg",
    "imageDesc": "Protesters in Myanmar demonstrating against the military coup.",
    "casualties": 3000,
    "displacement": 1000000,
    "basic_info": "The conflict has led to significant human rights violations and a deteriorating humanitarian situation.",
    "latitude": 21.9162,
    "longitude": 95.956,
    "charities_resources": [
      {
        "name": "UNHCR Myanmar",
        "url": "https://www.unhcr.org/myanmar.html"
      },
      {
        "name": "International Rescue Committee",
        "url": "https://www.rescue.org/country/myanmar"
      }
    ],
    "timeline": [
      {
        "date": "2021-02",
        "event": "Myanmar military stages a coup, overthrowing civilian government."
      },
      {
        "date": "2021-04",
        "event": "Mass protests and clashes with security forces lead to hundreds of deaths."
      },
      {
        "date": "2022",
        "event": "Ethnic armed groups escalate attacks against military forces."
      },
      {
        "date": "2023",
        "event": "International sanctions intensify, but conflict and human rights abuses continue."
      }
    ]
  }
]
